In [30]:
import numpy as np
import pandas as pd

## Series

In [31]:
arr = np.array([1,2,3,4])
s3 = pd.Series(arr).copy()
s3

0    1
1    2
2    3
3    4
dtype: int64

In [32]:
arr

array([1, 2, 3, 4])

In [49]:

# Assuming s2 and s3 are your Series objects
s2.name = 's2'
s3.name = 's3'


s3[0]=100

In [50]:
s3

0    100
1      2
2      3
3      4
Name: s3, dtype: int64

In [51]:
s2=s3

In [52]:
result = pd.merge(s2, s3, how='left', left_index=True, right_index=True)

In [53]:
result

   s3_x  s3_y
0   100   100
1     2     2
2     3     3
3     4     4

## Pandas

In [63]:
data = {'color' : ['blue','green','yellow','red','white'],
'object' : ['ball','pen','pencil','paper','mug'],
'price' : [1.2,1.0,0.6,0.9,1.7]}
df = pd.DataFrame(data)

In [64]:
df

    color  object  price
0    blue    ball    1.2
1   green     pen    1.0
2  yellow  pencil    0.6
3     red   paper    0.9
4   white     mug    1.7

In [65]:
df[['color']][0:3]

    color
0    blue
1   green
2  yellow

In [68]:
df.iloc[0,1]

'ball'

In [71]:
df.loc[1]

color     green
object      pen
price       1.0
Name: 1, dtype: object

In [74]:
df.isin(['ball'])

   color  object  price
0  False    True  False
1  False   False  False
2  False   False  False
3  False   False  False
4  False   False  False

In [75]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)),
index=['red','blue','yellow','white'],
columns=['ball','pen','pencil','paper'])

In [76]:
frame.drop('red',axis=0)

        ball  pen  pencil  paper
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [77]:
df = pd.DataFrame({
'name' : [ 'Chi', 'Alex', 'Sam', 'Hoang', 'Linh', 'Dung', 'Anh'],
'function' : [ 'Marketing', 'Tech', 'Tech', 'Finance', 'Finance', 'Marketing', 'HR'],
'address' : [ 'Hanoi', 'Saigon', 'Hanoi', 'Saigon', 'Hanoi', 'Hanoi', 'Saigon'],
'gender' : ['F', 'M', 'F', 'M', 'M', 'M', 'F'],
'favourite_fruit' : [ 'apple', 'banana', 'orange', 'watermelon', 'grape', np.NAN, 'kumquat'],
'age' : [20,25,21,26,30,31,23]
})

In [78]:
df

    name   function address gender favourite_fruit  age
0    Chi  Marketing   Hanoi      F           apple   20
1   Alex       Tech  Saigon      M          banana   25
2    Sam       Tech   Hanoi      F          orange   21
3  Hoang    Finance  Saigon      M      watermelon   26
4   Linh    Finance   Hanoi      M           grape   30
5   Dung  Marketing   Hanoi      M             NaN   31
6    Anh         HR  Saigon      F         kumquat   23

In [83]:
df[df['age']>30]

   name   function address gender favourite_fruit  age
5  Dung  Marketing   Hanoi      M             NaN   31

In [84]:
df.query('age >= 25 & address == "Hanoi"')

   name   function address gender favourite_fruit  age
4  Linh    Finance   Hanoi      M           grape   30
5  Dung  Marketing   Hanoi      M             NaN   31